translation/schizophrenia-in-contemporary-mathematics.org
#+include: use-org-page.org
#+title: schizophrenia in contemporary mathematics / 當代數學之精神分裂症
#+author: Errett Bishop

* 題解

  - 原文來源
    書名 errett bishop : reflections on him and his research
    Bishop 逝於 1983 年四月
    本書爲 1983 年九月 紀念 Bishop 逝世的會議記錄 出版於 1985 年

  - 其中只有一篇文章爲作者本人所寫 [其餘 階爲他人紀念 Bishop 所作]
    所譯正是此篇 schizophrenia in contemporary mathematics
    文章爲作者晚年所作
    1973 年首次出版

* 排版

  - 排版用 雙文
    譯文在先 原文在後
    原文 譯文 段段交叉 以便讀者對比 並指正譯文中不當之處

  - 譯文中
    方形括號內的段落爲我的筆記

  - 文章本不分節
    分節 與 章節標題 皆爲我所加

  - 文末有引用索引
    略而不譯
    有興趣者請自查原文

* 精神分裂諸症狀 / schizophrenic attributes of contemporary mathematics

*** 譯文

    - 過去的十年間
      我做了很多關於 構造主義數學 的演講
      我感覺我沒能把 我所體會到的 其中所涉及的哲學問題 傳達清楚

      既然今天我在這裏
      我還是希望能成功

      部分困難在於
      害怕太過消極
      或害怕產生太多敵意

      構造主義 是對所聲稱的 古典數學之濫用 的反應
      去檢驗這些 濫用 看似苦口
      但是唯有如此才能理解 構造主義之動機

    - 布勞維爾對古典數學的批評
      我總結其爲 意義之降質

      他機敏的批評 是他對構造主義的兩個主要貢獻之一
      另一個是 確立新的術語
      重新解釋邏輯連詞與量詞 賦予它們顯要的意義
      這些都是古典術語所缺乏的

    - 意義之降質 只是當代數學的問題點之一
      歸總起來 諸多的問題點揭示出一種匱乏 大部分數學領域有一種 '哲學短缺'
      所匱乏的是什麼 可能不明瞭
      但是各個方面的匱乏綜合起來的症狀
      我暫時稱之爲 '精神分裂症'

    - 我們可以列出很多當代數學的精神分裂症狀
      但是我想 如下種種 概括了很大範圍
      1. 放棄常識 而喜愛形式
      2. 執意拒絕適應現實 而致意義降質
      3. 不適合目的的方法
      4. 晦澀隱祕的交流方式
      5. 分裂
      ------

      1. 常識經常遭到攻擊
         取而代之的是方法論 進而退化成教條

         整理觀察與領悟 以形成方法 是不錯
         但是將方法提升爲教條 則有錯
         因爲那將阻礙新的觀察與領悟

         當代數學見證了形式主義教條的勝利
         起初形式主義所領悟的是
         現代數學中的論證都可以拆解開來
         然後以相繼施用一些基本策略的方式重新呈現出來
         這方面的專家們 常常視 如此這般的形式系統 爲數學之全貌
         證明 被認爲是操作字符串與符號
         數學哲學 則被認爲是 創造 對比 和研究 這些形式系統
         一致性 就是形式系統的目標
         導致 意義降質 甚至根本就不存在於主要層次中

      2. 意義降質還有一個源頭
         即 當代數學家執意拒絕檢驗他們某些術語的內含
         例如 '存在' 一詞
         他拒絕區分這個詞所能包含的不同意義
         而且 這個詞對他而言的意義 他含糊不清
         黨遭追問時 他就躲入形式主義的庇護所里
         宣稱 這個詞 還有使用了這個詞的語句
         只有在整個 假設和操作的集合 所形成的語境中 纔有意義

         這樣 他就本末倒置了
         他本應先發展出意義
         然後再把他的 假設與操作 構建在意義的根基上

         思考這種 意義之降質
         就是構造主義的首要動力

      3. 既然 意義已降質
         又 棄絕了常識
         那麼 發現 所用的方法 不適合目的
         也就沒有什麼大驚小怪的了

         應用數學中 大多數概念都來源於具體模型
         然後 通過這些概念 利用數學方法來理解現實

         黨 模型本身並非現實的合適表示時
         方法就是不適合的 (這種情況經常出現)

         人們的印象是
         模型的構建者 已經不關心現實了
         他們的模型已經變得自治
         這種現象就發生在數學哲學中
         - 模型就是形式體系
           它們既被當作研究數學本質的工具
           也被當作意義的載體

      4. 每個被教了大學數學的人
         一定對其 晦澀隱祕的交流方式 有印象
         'A 蘊含 B' 的意思是 '非 A 或 B'
         這是不自然的
         如果給學生機會的話 學生也會告訴你的

         當然 這不是致命的缺點
         關鍵是 蘊含式 的標準定義是否有用
         而不是其定義是否自然

         構造主義者 跟隨布勞維爾
         爭論說 蘊含式 的更自然的定義是更有用的
         這一點我們之後再展開

         很難傳達給學生的概念之一是 證明
         其原因就是 我們的表達方式太過晦澀隱祕

         大多數數學家
         黨被追問什麼是證明時
         都會援引形式主義的原則
         而與此相反
         證明這個概念 對於構造主義來說 就非常簡單
         我們將在適當的時候說明這一點

         同樣晦澀的 也許更困難的
         是 存在 這個概念
         與這個概念有關的問題已經提到了一些
         之後我們也會回到這個概念的討論

         最後 我想指出另一個晦澀的概念
         即 古典的 真 這個概念
         之後我們將會看到
         這對構造主義者來說 並沒有任何困難
         因爲他強調意義

      5. 數學的分裂
         部分原因是這個學科之曠闊
         但是分裂的現象被我們的教育系統惡化了
         純數學的研究生
         也許不會被要求通過多個數學分支的考試來拓寬自己的視野
         但是 他絕對不會被要求學習 (甚至是不鼓勵學習)
         數學的哲學 數學的歷史 或 數學的應用

         我們的教育系統使得我們生產
         能夠馬上發論文的研究型數學家
         這種 反社會 反理智 的行爲
         就它自己狹隘的目的而言 也是失敗的

         這種情況可能不會改變
         直到我們更改了我們對數學的認識
         在我們的教育體系還有職業價值有所改變之前
         我們首先要明白定理和證明的意義

         如果我們繼續把注意力集中在生產定理上
         並且繼續 貶值其內容
         那麼分裂就是不可避免的

         所謂 貶值其內容 我指如下這些情形
         - 對某些純數學家而言
           給定理和證明加上某些詮釋的唯一原因
           就是這些詮釋能夠促進生產這些定理和證明
           對他們而言所詮釋出的內容是工具 而不是目的
         - 另外一些人覺得 有某些內容是重要的
           但是並不在意找到它們
         - 還有一些人
           (Godel 看來是其代言人 參考例如
            [Godel, K., "What is Cantor's Continuum Problem?"
            Amer. Math. Monthly, 54 (1947), 515-525.])
           他們盡力發展內容
           但是只在廣爲接受的柏拉圖理想主義的框架之內

         有人懷疑大多數的純數學家 (屬上述中的前兩種)
         儘可能地忽略內容
         如果你覺得這種懷疑不公正
         可以停下來想想現代概率論
         一個事件的概率 常常被取作 0 與 1 之間的實數
         一個人可能天真地推測 概率論家會想要計算出這些實數
         瞧瞧現代的任意一本教材吧
         (比如 Doob 的傑出作品
          [Doob, J. L., "Stochastic Processes," Wiley, New York, 1953.])
         看了之後就能解除他對我們的猜測的疑慮了
         分裂性保證了很多定理 (如果不說是絕大多數定理)
         對與想要實際計算概率的人來說是沒用的
         想要實際計算概率的話
         他要麼設計出自己的理論 要麼利用臨時技術 還有經驗法則
         我並不宣稱
         讓概率論重新包含 有關意義的基礎問題
         就能將分裂的趨勢反過來
         只不過這是必要的第一步
         最近幾年少數構造主義數學家
         (可見 [3], [9], [10], [11],[12], [23], [24])
         [有興趣的讀者請查看原文索引]
         試着幫助概率論學家走出這一步
         他們的努力最終是否會被欣賞 我們拭目以待

    - 當我試圖用積極的詞語來表達
      當代數學所缺乏的特性時
      我把這種缺乏稱作 '精神分裂症'
      我還常常想到 '完整性' 這個術語
      不是說形式主義意義上的孤立的完整性
      那是驕傲地維護自己所制定的標準的優越性
      而我所說的 '完整性' 指
      - 在 數學 應用數學 還有數學向的領域 例如物理學 中
        尋找共同的根基
      - 在每個新的發展中
        尋求萃取出最多的意義
      - 主要爲內容所指引
        而不是形式上優雅
      - 數學對現實的表達
        並不降級爲一個遊戲
      - 尋求理解數學在當代社會中的意義

      這種完整性也許不可能實現
      但是這並不重要
      我喜歡把構造主義想成是
      爲了實現 哪怕是部分實現 這種理想化的完整性
      的一次嘗試
      這種假定起碼能防止構造主義變成另外一個遊戲
      就像某些構造主義者過去所做的

*** 記

    - 關於 晦澀隱祕的交流方式
      我認爲是數學中語言設計的種種失誤所致
      然而 一般人並不認爲數學中需要什麼 '語言設計'

