docs/source/_posts/translation/schizophrenia-in-contemporary-mathematics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-28 Thu 21:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>schizophrenia in contemporary mathematics / 當代數學之精神分裂症</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Errett Bishop" />
<link rel="stylesheet" href="../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">schizophrenia in contemporary mathematics / 當代數學之精神分裂症</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org562a0ef">題解</a></li>
<li><a href="#orgacdca0b">排版</a></li>
<li><a href="#orga1ed722">精神分裂諸症狀 / schizophrenic attributes of contemporary mathematics</a>
<ul>
<li><a href="#org7c91374">譯文</a></li>
<li><a href="#org3f333b3">記</a></li>
<li><a href="#org4576923">原文</a></li>
</ul>
</li>
<li><a href="#org5ee4e15">構造主義基本四原則 / four basic principles for constructivism</a>
<ul>
<li><a href="#org70799e1">譯文</a></li>
<li><a href="#orgba87e0f">原文</a></li>
</ul>
</li>
<li><a href="#org7779f38">總結 / conclude</a>
<ul>
<li><a href="#org303bb78">譯文</a></li>
<li><a href="#org7e10ad1">原文</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org562a0ef" class="outline-2">
<h2 id="org562a0ef">題解</h2>
<div class="outline-text-2" id="text-org562a0ef">
<ul class="org-ul">
<li><p>原文來源</p><p>書名 errett bishop : reflections on him and his research</p><p>Bishop 逝於 1983 年四月</p><p>本書爲 1983 年九月 紀念 Bishop 逝世的會議記錄 出版於 1985 年</p></li>

<li><p>其中只有一篇文章爲作者本人所寫 [其餘 階爲他人紀念 Bishop 所作]</p><p>所譯正是此篇 schizophrenia in contemporary mathematics</p><p>文章爲作者晚年所作</p><p>1973 年首次出版</p></li></ul>
</div>
</div>

<div id="outline-container-orgacdca0b" class="outline-2">
<h2 id="orgacdca0b">排版</h2>
<div class="outline-text-2" id="text-orgacdca0b">
<ul class="org-ul">
<li><p>排版用 雙文</p><p>譯文在先 原文在後</p><p>原文 譯文 段段交叉 以便讀者對比 並指正譯文中不當之處</p></li>

<li><p>譯文中</p><p>方形括號內的段落爲我的筆記</p></li>

<li><p>文章本不分節</p><p>分節 與 章節標題 皆爲我所加</p></li>

<li><p>文末有引用索引</p><p>略而不譯</p><p>有興趣者請自查原文</p></li></ul>
</div>
</div>

<div id="outline-container-orga1ed722" class="outline-2">
<h2 id="orga1ed722">精神分裂諸症狀 / schizophrenic attributes of contemporary mathematics</h2>
<div class="outline-text-2" id="text-orga1ed722">
</div><div id="outline-container-org7c91374" class="outline-3">
<h3 id="org7c91374">譯文</h3>
<div class="outline-text-3" id="text-org7c91374">
<ul class="org-ul">
<li><p><p></p><p>過去的十年間</p><p>我做了很多關於 構造主義數學 的演講</p><p>我感覺我沒能把 我所體會到的 其中所涉及的哲學問題 傳達清楚</p><p></p></p><p></p><p><p></p><p>既然今天我在這裏</p><p>我還是希望能成功</p><p></p></p><p></p><p><p></p><p>部分困難在於</p><p>害怕太過消極</p><p>或害怕產生太多敵意</p><p></p></p><p></p><p><p></p><p>構造主義 是對所聲稱的 古典數學之濫用 的反應</p><p>去檢驗這些 濫用 看似苦口</p><p>但是唯有如此才能理解 構造主義之動機</p><p></p></p></li>

<li><p><p></p><p>布勞維爾對古典數學的批評</p><p>我總結其爲 意義之降質</p><p></p></p><p></p><p><p></p><p>他機敏的批評 是他對構造主義的兩個主要貢獻之一</p><p>另一個是 確立新的術語</p><p>重新解釋邏輯連詞與量詞 賦予它們顯要的意義</p><p>這些都是古典術語所缺乏的</p><p></p></p></li>

<li><p>意義之降質 只是當代數學的問題點之一</p><p>歸總起來 諸多的問題點揭示出一種匱乏 大部分數學領域有一種 '哲學短缺'</p><p>所匱乏的是什麼 可能不明瞭</p><p>但是各個方面的匱乏綜合起來的症狀</p><p>我暫時稱之爲 '精神分裂症'</p></li>

<li><p><p></p><p>我們可以列出很多當代數學的精神分裂症狀</p><p>但是我想 如下種種 概括了很大範圍</p><p></p></p><p><ol class="org-ol"></p><p><li>放棄常識 而喜愛形式</li></p><p><li>執意拒絕適應現實 而致意義降質</li></p><p><li>不適合目的的方法</li></p><p><li>晦澀隱祕的交流方式</li></p><p><li>分裂</li></ol></p><p><hr  /></p><p></p><p><ol class="org-ol"></p><p><li><p></p><p>常識經常遭到攻擊</p><p>取而代之的是方法論 進而退化成教條</p><p></p></p><p></p><p><p></p><p>整理觀察與領悟 以形成方法 是不錯</p><p>但是將方法提升爲教條 則有錯</p><p>因爲那將阻礙新的觀察與領悟</p><p></p></p><p></p><p><p></p><p>當代數學見證了形式主義教條的勝利</p><p>起初形式主義所領悟的是</p><p>現代數學中的論證都可以拆解開來</p><p>然後以相繼施用一些基本策略的方式重新呈現出來</p><p>這方面的專家們 常常視 如此這般的形式系統 爲數學之全貌</p><p>證明 被認爲是操作字符串與符號</p><p>數學哲學 則被認爲是 創造 對比 和研究 這些形式系統</p><p>一致性 就是形式系統的目標</p><p>導致 意義降質 甚至根本就不存在於主要層次中</p><p></p></li></p><p></p><p><li><p></p><p>意義降質還有一個源頭</p><p>即 當代數學家執意拒絕檢驗他們某些術語的內含</p><p>例如 '存在' 一詞</p><p>他拒絕區分這個詞所能包含的不同意義</p><p>而且 這個詞對他而言的意義 他含糊不清</p><p>黨遭追問時 他就躲入形式主義的庇護所里</p><p>宣稱 這個詞 還有使用了這個詞的語句</p><p>只有在整個 假設和操作的集合 所形成的語境中 纔有意義</p><p></p></p><p></p><p><p></p><p>這樣 他就本末倒置了</p><p>他本應先發展出意義</p><p>然後再把他的 假設與操作 構建在意義的根基上</p><p></p></p><p></p><p><p></p><p>思考這種 意義之降質</p><p>就是構造主義的首要動力</p><p></p></li></p><p></p><p><li><p></p><p>既然 意義已降質</p><p>又 棄絕了常識</p><p>那麼 發現 所用的方法 不適合目的</p><p>也就沒有什麼大驚小怪的了</p><p></p></p><p></p><p><p></p><p>應用數學中 大多數概念都來源於具體模型</p><p>然後 通過這些概念 利用數學方法來理解現實</p><p></p></p><p></p><p><p></p><p>黨 模型本身並非現實的合適表示時</p><p>方法就是不適合的 (這種情況經常出現)</p><p></p></p><p></p><p><p></p><p>人們的印象是</p><p>模型的構建者 已經不關心現實了</p><p>他們的模型已經變得自治</p><p>這種現象就發生在數學哲學中</p><p></p></p><p><ul class="org-ul"></p><p><li><p>模型就是形式體系</p><p>它們既被當作研究數學本質的工具</p><p>也被當作意義的載體</p></li></ul></li></p><p></p><p><li><p></p><p>每個被教了大學數學的人</p><p>一定對其 晦澀隱祕的交流方式 有印象</p><p>'A 蘊含 B' 的意思是 '非 A 或 B'</p><p>這是不自然的</p><p>如果給學生機會的話 學生也會告訴你的</p><p></p></p><p></p><p><p></p><p>當然 這不是致命的缺點</p><p>關鍵是 蘊含式 的標準定義是否有用</p><p>而不是其定義是否自然</p><p></p></p><p></p><p><p></p><p>構造主義者 跟隨布勞維爾</p><p>爭論說 蘊含式 的更自然的定義是更有用的</p><p>這一點我們之後再展開</p><p></p></p><p></p><p><p></p><p>很難傳達給學生的概念之一是 證明</p><p>其原因就是 我們的表達方式太過晦澀隱祕</p><p></p></p><p></p><p><p></p><p>大多數數學家</p><p>黨被追問什麼是證明時</p><p>都會援引形式主義的原則</p><p>而與此相反</p><p>證明這個概念 對於構造主義來說 就非常簡單</p><p>我們將在適當的時候說明這一點</p><p></p></p><p></p><p><p></p><p>同樣晦澀的 也許更困難的</p><p>是 存在 這個概念</p><p>與這個概念有關的問題已經提到了一些</p><p>之後我們也會回到這個概念的討論</p><p></p></p><p></p><p><p></p><p>最後 我想指出另一個晦澀的概念</p><p>即 古典的 真 這個概念</p><p>之後我們將會看到</p><p>這對構造主義者來說 並沒有任何困難</p><p>因爲他強調意義</p><p></p></li></p><p></p><p><li><p></p><p>數學的分裂</p><p>部分原因是這個學科之曠闊</p><p>但是分裂的現象被我們的教育系統惡化了</p><p>純數學的研究生</p><p>也許不會被要求通過多個數學分支的考試來拓寬自己的視野</p><p>但是 他絕對不會被要求學習 (甚至是不鼓勵學習)</p><p>數學的哲學 數學的歷史 或 數學的應用</p><p></p></p><p></p><p><p></p><p>我們的教育系統使得我們生產</p><p>能夠馬上發論文的研究型數學家</p><p>這種 反社會 反理智 的行爲</p><p>就它自己狹隘的目的而言 也是失敗的</p><p></p></p><p></p><p><p></p><p>這種情況可能不會改變</p><p>直到我們更改了我們對數學的認識</p><p>在我們的教育體系還有職業價值有所改變之前</p><p>我們首先要明白定理和證明的意義</p><p></p></p><p></p><p><p></p><p>如果我們繼續把注意力集中在生產定理上</p><p>並且繼續 貶值其內容</p><p>那麼分裂就是不可避免的</p><p></p></p><p></p><p><p></p><p>所謂 貶值其內容 我指如下這些情形</p><p></p></p><p><ul class="org-ul"></p><p><li><p>對某些純數學家而言</p><p>給定理和證明加上某些詮釋的唯一原因</p><p>就是這些詮釋能夠促進生產這些定理和證明</p><p>對他們而言所詮釋出的內容是工具 而不是目的</p></li></p><p><li><p>另外一些人覺得 有某些內容是重要的</p><p>但是並不在意找到它們</p></li></p><p><li><p>還有一些人</p><p>(Godel 看來是其代言人 參考例如</p><p> [Godel, K., "What is Cantor's Continuum Problem?"</p><p> Amer. Math. Monthly, 54 (1947), 515-525.])</p><p>他們盡力發展內容</p><p>但是只在廣爲接受的柏拉圖理想主義的框架之內</p></li></ul></p><p><p></p><p>有人懷疑大多數的純數學家 (屬上述中的前兩種)</p><p>儘可能地忽略內容</p><p>如果你覺得這種懷疑不公正</p><p>可以停下來想想現代概率論</p><p>一個事件的概率 常常被取作 0 與 1 之間的實數</p><p>一個人可能天真地推測 概率論家會想要計算出這些實數</p><p>瞧瞧現代的任意一本教材吧</p><p>(比如 Doob 的傑出作品</p><p> [Doob, J. L., "Stochastic Processes," Wiley, New York, 1953.])</p><p>看了之後就能解除他對我們的猜測的疑慮了</p><p>分裂性保證了很多定理 (如果不說是絕大多數定理)</p><p>對與想要實際計算概率的人來說是沒用的</p><p>想要實際計算概率的話</p><p>他要麼設計出自己的理論 要麼利用臨時技術 還有經驗法則</p><p>我並不宣稱</p><p>讓概率論重新包含 有關意義的基礎問題</p><p>就能將分裂的趨勢反過來</p><p>只不過這是必要的第一步</p><p>最近幾年少數構造主義數學家</p><p>(可見 [3], [9], [10], [11],[12], [23], [24])</p><p>[有興趣的讀者請查看原文索引]</p><p>試着幫助概率論學家走出這一步</p><p>他們的努力最終是否會被欣賞 我們拭目以待</p><p></p></li></ol></p></li>

<li><p><p></p><p>當我試圖用積極的詞語來表達</p><p>當代數學所缺乏的特性時</p><p>我把這種缺乏稱作 '精神分裂症'</p><p>我還常常想到 '完整性' 這個術語</p><p>不是說形式主義意義上的孤立的完整性</p><p>那是驕傲地維護自己所制定的標準的優越性</p><p>而我所說的 '完整性' 指</p><p></p></p><p><ul class="org-ul"></p><p><li><p>在 數學 應用數學 還有數學向的領域 例如物理學 中</p><p>尋找共同的根基</p></li></p><p><li><p>在每個新的發展中</p><p>尋求萃取出最多的意義</p></li></p><p><li><p>主要爲內容所指引</p><p>而不是形式上優雅</p></li></p><p><li><p>數學對現實的表達</p><p>並不降級爲一個遊戲</p></li></p><p><li><p>尋求理解數學在當代社會中的意義</p></li></ul></p><p><p></p><p>這種完整性也許不可能實現</p><p>但是這並不重要</p><p>我喜歡把構造主義想成是</p><p>爲了實現 哪怕是部分實現 這種理想化的完整性</p><p>的一次嘗試</p><p>這種假定起碼能防止構造主義變成另外一個遊戲</p><p>就像某些構造主義者過去所做的</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org3f333b3" class="outline-3">
<h3 id="org3f333b3">記</h3>
<div class="outline-text-3" id="text-org3f333b3">
<ul class="org-ul">
<li><p>關於 晦澀隱祕的交流方式</p><p>我認爲是數學中語言設計的種種失誤所致</p><p>然而 一般人並不認爲數學中需要什麼 '語言設計'</p></li></ul>
</div>
</div>
