translation/schizophrenia-in-contemporary-mathematics.org
*** 原文

    - During the past ten years
      I have given a number of lectures
      on the subject of constructive mathematics.
      My general impression is that
      I have failed to communicate a real feeling
      for the philosophical issues involved.

      Since I am here today,
      I still have hopes of being able to do so.

      Part of the difficulty is the fear of
      seeming to be too negativistic
      and generating too much hostility.

      Constructivism is a reaction
      to certain alleged abuses of classical mathematics.
      Unpalatable as it may be
      to have those abuses examined,
      there is no other way
      to understand the motivations of the constructivists.

    - Brouwer's criticisms of classical mathematics
      were concerned with what I shall refer to as
      "the debasement of meaning."

      (His incisive criticisms
       were one of his two main contributions to constructivism.
       His other was to establish a new terminology,
       involving a re-interpretation
       of the usual connectives and quantifiers,
       which permits the expression
       of certain important distinctions of meaning
       which the classical terminology does not.)

    - The debasement of meaning
      is just one of the trouble spots in contemporary mathematics.
      Taken all together,
      these trouble spots indicate that something is lacking,
      that there is a philosophical deficit of major proportions.
      What it is that is lacking is perhaps not clear,
      but the lack in all of its aspects constitutes a syndrome
      I shall tentatively describe as "schizophrenia."

    - One could probably make a long list
      of schizophrenic attributes of contemporary mathematics,
      but I think the following short list
      covers most of the ground:
      1. rejection of common sense in favor of formalism;
      2. debasement of meaning
         by wilful refusal to accommodate certain aspects of reality;
      3. inappropriateness of means to ends;
      4. the esoteric quality of the communication;
      5. and fragmentation.
      ---------------

      1. Common sense is a quality that is constantly under attack.
         It tends to be supplanted by methodology, shading into dogma.

         The codification of insight is commendable
         only to the extent that
         the resulting methodology is not elevated to dogma
         and there by allowed to impede the formation of new insight.

         Contemporary mathematics has witnessed the triumph of formalist dogma,
         which had its inception in the important insight that
         most arguments of modern mathematics
         can be broken down and presented
         as successive applications of a few basic schemes.
         The experts now routinely equate the panorama of mathematics
         with the productions of this or that formal system.
         Proofs are thought of as manipulations of strings of symbols.
         Mathematical philosophy
         consists of the creation, comparison, and investigation of formal systems.
         Consistency is the goal.
         In consequence meaning is debased,
         and even ceases to exist at a primary level.

      2. The debasement of meaning has yet another source,
         the wilful refusal of the contemporary mathematician
         to examine the content of certain of his terms,
         such as the phrase "there exists."
         He refuses to distinguish among the different meanings
         that might be ascribed to this phrase.
         Moreover he is vague about what meaning it has for him.
         When pressed he is apt to take refuge in formalisties,
         declaring that
         the meaning of the phrase
         and the statements of which it forms a part
         can only be understood in the context of
         the entire set of assumptions
         and techniques at his command.

         Thus he inverts the natural order,
         which would be to develop meaning first,
         and then to base his assumptions and techniques
         on the rock of meaning.

         Concern about this debasement of meaning
         is a principal force behind constructivism.

      3. Since meaning is debased
         and common sense is rejected,
         it is not surprising to find that
         the means are inappropriate to the ends.

         Applied mathematics makes much of the concept of a model,
         as a tool for dealing with reality by mathematical means.
         When the model is not an adequate representation of reality,
         as happens only too often,
         the means are inappropriate.

         One gets the impression that some of the model-builders
         are no longer interested in reality.
         Their models have become autonomous.
         This has clearly happened in mathematical philosophy:
         - the models (formal systems)
           are accepted as the preferred tools
           for investigation the nature of mathematics,
           and even as the font of meaning.

      4. Everyone who has taught undergraduate mathematics
         must have been impressed by the esoteric quality of the communication.
         It is not natural
         for "A implies B"
         to mean "not A or B"
         and students will tell you so
         if you give them the chance.

         Of course,
         this is not a fatal objection.
         The question is,
         - whether the standard definition of implication is useful,
           not whether it is natural.

         The constructivist, following Brouwer,
         contends that
         a more natural definition of implication
         would be more useful.
         This point will be developed later.

         One of the hardest concepts
         to communicate to the undergraduate
         is the concept of a proof.
         With good reason -- the concept is esoteric.

         Most mathematicians,
         when pressed to say what they mean by a proof,
         will have recourse to formal criteria.
         The constructive notion of proof by contrast is very simple,
         as we shall see in due course.

         Equally esoteric, and perhaps more trouble some,
         is the concept of existence.
         Some of the problems associated with this concept
         have already been mentioned,
         and we shall return to the subject again.

         Finally, I wish to point out the esoteric nature
         of the classical concept of truth.
         As we shall see later,
         truth is not a source of trouble to the constructivist,
         because of his emphasis on meaning.

      5. The fragmentation of mathematics
         is due in part to the vastness of the subject,
         but it is aggravated by our educational system.
         A graduate student in pure mathematics
         may or may not be required to broaden himself
         by passing examinations in various branches of pure mathematics,
         but he will almost certainly not be required or even encouraged
         to acquaint himself with
         the philosophy of mathematics,
         its history,
         or its applications.

         We have geared ourselves
         to producing research mathematicians
         who will begin to write papers as soon as possible.
         This anti-social and anti-intellectual process
         defeats even its own narrow ends.

         The situation is not likely to change
         until we modify our conception of what mathematics is.
         Before important changes will come about
         in our methods of education
         and our professional values,
         we shall have to discover the significance of theorem and proof.

         If we continue to focus attention
         on the process of producing theorems,
         and continue to devalue their content,
         fragmentation is inevitable.

    - By devaluation of content I mean the following.
      - To some pure mathematicians
        the only reason for attaching any interpretation whatever
        to theorem and proof is that
        the process of producing theorems and proofs is thereby facilitated.
        For them content is a means rather than the end.
      - Others feel that it is important to have some content,
        but don't especially care to find out what it is.
      - Still others, for whom Godel seems to be a leading spokesman,
        (see for example
         [Godel, K., "What is Cantor's Continuum Problem?"
          Amer. Math. Monthly, 54 (1947), 515-525.])
        do their best to develop content
        within the accepted framework of platonic idealism.

    - One suspects that the majority of pure mathematicians,
      who belong to the union of the first two groups,
      ignore as much content as they possibly can.
      If this suspicion seems unjust,
      pause to consider the modern theory of probability.
      The probability of an event
      is commonly taken to be a real number between 0 and 1.
      One might naively expect that
      the probabilists would concern themselves
      with the computation of such real numbers.
      If so, a quick look at any one of a number of modern texts,
      for instancethe excellent book of Doob,
      [Doob, J. L., "Stochastic Processes," Wiley, New York, 1953.]
      should suffice to disabuse him of that expectation.

      Fragmentation ensues,
      because much if not most of the theory is useless to someone
      who is concerned with actually finding probabilities.
      He will either develop his own semi-independent theories,
      or else work with ad hoc techniques and rules of thumb.
      I do not claim that
      re-involvement of the probabilists
      with the basic questions of meaning
      would of itself reverse the process of fragmentation of their discipline,
      only that it is a necessary first step.
      In recent years a small number of constructivists
      (see [3], [9], [10], [11],[12], [23], and [24])
      have been trying to help the probabilists take that step.
      Whether their efforts will ultimately be appreciated remains to be seen.

    - When I attempt to express in positive terms that quality
      in which contemporary mathematics is deficient,
      the absence of which I have characterized as "schizophrenia,"
      I keep coming back to the term "integrity."
      Not the integrity of an isolated formalism
      that prides itself on the maintenance of its own standards of excellence,
      but an integrity
      - that seeks common ground
        in the researches of pure mathematics,
        applied mathematics,
        and such mathematically oriented disciplines as physics;
      - that seeks to extract the maximum meaning
        from each new development;
      - that is guided primarily by considerations of content
        rather than elegance and formal attractiveness;
      - that sees to it that
        the mathematical representation of reality
        does not degenerate into a game;
      - that seeks to understand
        the place of mathematics in contemporary society.

      This integrity may not be possible of realization,
      but that is not important.
      I like to think of constructivism
      as one attempt to realize
      at least certain aspects of this idealized integrity.
      This presumption
      at least has the possible merit of
      preventing constructivism from becoming another game,
      as some constructivisms have tended to do in the past.

