docs/source/_posts/translation/schizophrenia-in-contemporary-mathematics.html

<div id="outline-container-org4576923" class="outline-3">
<h3 id="org4576923">原文</h3>
<div class="outline-text-3" id="text-org4576923">
<ul class="org-ul">
<li><p><p></p><p>During the past ten years</p><p>I have given a number of lectures</p><p>on the subject of constructive mathematics.</p><p>My general impression is that</p><p>I have failed to communicate a real feeling</p><p>for the philosophical issues involved.</p><p></p></p><p></p><p><p></p><p>Since I am here today,</p><p>I still have hopes of being able to do so.</p><p></p></p><p></p><p><p></p><p>Part of the difficulty is the fear of</p><p>seeming to be too negativistic</p><p>and generating too much hostility.</p><p></p></p><p></p><p><p></p><p>Constructivism is a reaction</p><p>to certain alleged abuses of classical mathematics.</p><p>Unpalatable as it may be</p><p>to have those abuses examined,</p><p>there is no other way</p><p>to understand the motivations of the constructivists.</p><p></p></p></li>

<li><p><p></p><p>Brouwer's criticisms of classical mathematics</p><p>were concerned with what I shall refer to as</p><p>"the debasement of meaning."</p><p></p></p><p></p><p><p></p><p>(His incisive criticisms</p><p> were one of his two main contributions to constructivism.</p><p> His other was to establish a new terminology,</p><p> involving a re-interpretation</p><p> of the usual connectives and quantifiers,</p><p> which permits the expression</p><p> of certain important distinctions of meaning</p><p> which the classical terminology does not.)</p><p></p></p></li>

<li><p>The debasement of meaning</p><p>is just one of the trouble spots in contemporary mathematics.</p><p>Taken all together,</p><p>these trouble spots indicate that something is lacking,</p><p>that there is a philosophical deficit of major proportions.</p><p>What it is that is lacking is perhaps not clear,</p><p>but the lack in all of its aspects constitutes a syndrome</p><p>I shall tentatively describe as "schizophrenia."</p></li>

<li><p><p></p><p>One could probably make a long list</p><p>of schizophrenic attributes of contemporary mathematics,</p><p>but I think the following short list</p><p>covers most of the ground:</p><p></p></p><p><ol class="org-ol"></p><p><li>rejection of common sense in favor of formalism;</li></p><p><li>debasement of meaning</p><p>by wilful refusal to accommodate certain aspects of reality;</li></p><p><li>inappropriateness of means to ends;</li></p><p><li>the esoteric quality of the communication;</li></p><p><li>and fragmentation.</li></ol></p><p><hr  /></p><p></p><p><ol class="org-ol"></p><p><li><p></p><p>Common sense is a quality that is constantly under attack.</p><p>It tends to be supplanted by methodology, shading into dogma.</p><p></p></p><p></p><p><p></p><p>The codification of insight is commendable</p><p>only to the extent that</p><p>the resulting methodology is not elevated to dogma</p><p>and there by allowed to impede the formation of new insight.</p><p></p></p><p></p><p><p></p><p>Contemporary mathematics has witnessed the triumph of formalist dogma,</p><p>which had its inception in the important insight that</p><p>most arguments of modern mathematics</p><p>can be broken down and presented</p><p>as successive applications of a few basic schemes.</p><p>The experts now routinely equate the panorama of mathematics</p><p>with the productions of this or that formal system.</p><p>Proofs are thought of as manipulations of strings of symbols.</p><p>Mathematical philosophy</p><p>consists of the creation, comparison, and investigation of formal systems.</p><p>Consistency is the goal.</p><p>In consequence meaning is debased,</p><p>and even ceases to exist at a primary level.</p><p></p></li></p><p></p><p><li><p></p><p>The debasement of meaning has yet another source,</p><p>the wilful refusal of the contemporary mathematician</p><p>to examine the content of certain of his terms,</p><p>such as the phrase "there exists."</p><p>He refuses to distinguish among the different meanings</p><p>that might be ascribed to this phrase.</p><p>Moreover he is vague about what meaning it has for him.</p><p>When pressed he is apt to take refuge in formalisties,</p><p>declaring that</p><p>the meaning of the phrase</p><p>and the statements of which it forms a part</p><p>can only be understood in the context of</p><p>the entire set of assumptions</p><p>and techniques at his command.</p><p></p></p><p></p><p><p></p><p>Thus he inverts the natural order,</p><p>which would be to develop meaning first,</p><p>and then to base his assumptions and techniques</p><p>on the rock of meaning.</p><p></p></p><p></p><p><p></p><p>Concern about this debasement of meaning</p><p>is a principal force behind constructivism.</p><p></p></li></p><p></p><p><li><p></p><p>Since meaning is debased</p><p>and common sense is rejected,</p><p>it is not surprising to find that</p><p>the means are inappropriate to the ends.</p><p></p></p><p></p><p><p></p><p>Applied mathematics makes much of the concept of a model,</p><p>as a tool for dealing with reality by mathematical means.</p><p>When the model is not an adequate representation of reality,</p><p>as happens only too often,</p><p>the means are inappropriate.</p><p></p></p><p></p><p><p></p><p>One gets the impression that some of the model-builders</p><p>are no longer interested in reality.</p><p>Their models have become autonomous.</p><p>This has clearly happened in mathematical philosophy:</p><p></p></p><p><ul class="org-ul"></p><p><li><p>the models (formal systems)</p><p>are accepted as the preferred tools</p><p>for investigation the nature of mathematics,</p><p>and even as the font of meaning.</p></li></ul></li></p><p></p><p><li><p></p><p>Everyone who has taught undergraduate mathematics</p><p>must have been impressed by the esoteric quality of the communication.</p><p>It is not natural</p><p>for "A implies B"</p><p>to mean "not A or B"</p><p>and students will tell you so</p><p>if you give them the chance.</p><p></p></p><p></p><p><p></p><p>Of course,</p><p>this is not a fatal objection.</p><p>The question is,</p><p></p></p><p><ul class="org-ul"></p><p><li><p>whether the standard definition of implication is useful,</p><p>not whether it is natural.</p></li></ul></p><p><p></p><p>The constructivist, following Brouwer,</p><p>contends that</p><p>a more natural definition of implication</p><p>would be more useful.</p><p>This point will be developed later.</p><p></p></p><p></p><p><p></p><p>One of the hardest concepts</p><p>to communicate to the undergraduate</p><p>is the concept of a proof.</p><p>With good reason &#x2013; the concept is esoteric.</p><p></p></p><p></p><p><p></p><p>Most mathematicians,</p><p>when pressed to say what they mean by a proof,</p><p>will have recourse to formal criteria.</p><p>The constructive notion of proof by contrast is very simple,</p><p>as we shall see in due course.</p><p></p></p><p></p><p><p></p><p>Equally esoteric, and perhaps more trouble some,</p><p>is the concept of existence.</p><p>Some of the problems associated with this concept</p><p>have already been mentioned,</p><p>and we shall return to the subject again.</p><p></p></p><p></p><p><p></p><p>Finally, I wish to point out the esoteric nature</p><p>of the classical concept of truth.</p><p>As we shall see later,</p><p>truth is not a source of trouble to the constructivist,</p><p>because of his emphasis on meaning.</p><p></p></li></p><p></p><p><li><p></p><p>The fragmentation of mathematics</p><p>is due in part to the vastness of the subject,</p><p>but it is aggravated by our educational system.</p><p>A graduate student in pure mathematics</p><p>may or may not be required to broaden himself</p><p>by passing examinations in various branches of pure mathematics,</p><p>but he will almost certainly not be required or even encouraged</p><p>to acquaint himself with</p><p>the philosophy of mathematics,</p><p>its history,</p><p>or its applications.</p><p></p></p><p></p><p><p></p><p>We have geared ourselves</p><p>to producing research mathematicians</p><p>who will begin to write papers as soon as possible.</p><p>This anti-social and anti-intellectual process</p><p>defeats even its own narrow ends.</p><p></p></p><p></p><p><p></p><p>The situation is not likely to change</p><p>until we modify our conception of what mathematics is.</p><p>Before important changes will come about</p><p>in our methods of education</p><p>and our professional values,</p><p>we shall have to discover the significance of theorem and proof.</p><p></p></p><p></p><p><p></p><p>If we continue to focus attention</p><p>on the process of producing theorems,</p><p>and continue to devalue their content,</p><p>fragmentation is inevitable.</p><p></p></li></ol></p></li>

<li><p>By devaluation of content I mean the following.</p><p><ul class="org-ul"></p><p><li><p>To some pure mathematicians</p><p>the only reason for attaching any interpretation whatever</p><p>to theorem and proof is that</p><p>the process of producing theorems and proofs is thereby facilitated.</p><p>For them content is a means rather than the end.</p></li></p><p><li><p>Others feel that it is important to have some content,</p><p>but don't especially care to find out what it is.</p></li></p><p><li><p>Still others, for whom Godel seems to be a leading spokesman,</p><p>(see for example</p><p> [Godel, K., "What is Cantor's Continuum Problem?"</p><p>  Amer. Math. Monthly, 54 (1947), 515-525.])</p><p>do their best to develop content</p><p>within the accepted framework of platonic idealism.</p></li></ul></p></li>

<li><p><p></p><p>One suspects that the majority of pure mathematicians,</p><p>who belong to the union of the first two groups,</p><p>ignore as much content as they possibly can.</p><p>If this suspicion seems unjust,</p><p>pause to consider the modern theory of probability.</p><p>The probability of an event</p><p>is commonly taken to be a real number between 0 and 1.</p><p>One might naively expect that</p><p>the probabilists would concern themselves</p><p>with the computation of such real numbers.</p><p>If so, a quick look at any one of a number of modern texts,</p><p>for instancethe excellent book of Doob,</p><p>[Doob, J. L., "Stochastic Processes," Wiley, New York, 1953.]</p><p>should suffice to disabuse him of that expectation.</p><p></p></p><p></p><p><p></p><p>Fragmentation ensues,</p><p>because much if not most of the theory is useless to someone</p><p>who is concerned with actually finding probabilities.</p><p>He will either develop his own semi-independent theories,</p><p>or else work with ad hoc techniques and rules of thumb.</p><p>I do not claim that</p><p>re-involvement of the probabilists</p><p>with the basic questions of meaning</p><p>would of itself reverse the process of fragmentation of their discipline,</p><p>only that it is a necessary first step.</p><p>In recent years a small number of constructivists</p><p>(see [3], [9], [10], [11],[12], [23], and [24])</p><p>have been trying to help the probabilists take that step.</p><p>Whether their efforts will ultimately be appreciated remains to be seen.</p><p></p></p></li>

<li><p><p></p><p>When I attempt to express in positive terms that quality</p><p>in which contemporary mathematics is deficient,</p><p>the absence of which I have characterized as "schizophrenia,"</p><p>I keep coming back to the term "integrity."</p><p>Not the integrity of an isolated formalism</p><p>that prides itself on the maintenance of its own standards of excellence,</p><p>but an integrity</p><p></p></p><p><ul class="org-ul"></p><p><li><p>that seeks common ground</p><p>in the researches of pure mathematics,</p><p>applied mathematics,</p><p>and such mathematically oriented disciplines as physics;</p></li></p><p><li><p>that seeks to extract the maximum meaning</p><p>from each new development;</p></li></p><p><li><p>that is guided primarily by considerations of content</p><p>rather than elegance and formal attractiveness;</p></li></p><p><li><p>that sees to it that</p><p>the mathematical representation of reality</p><p>does not degenerate into a game;</p></li></p><p><li><p>that seeks to understand</p><p>the place of mathematics in contemporary society.</p></li></ul></p><p><p></p><p>This integrity may not be possible of realization,</p><p>but that is not important.</p><p>I like to think of constructivism</p><p>as one attempt to realize</p><p>at least certain aspects of this idealized integrity.</p><p>This presumption</p><p>at least has the possible merit of</p><p>preventing constructivism from becoming another game,</p><p>as some constructivisms have tended to do in the past.</p><p></p></p></li></ul>
</div>
</div>
</div>
