translation/schizophrenia-in-contemporary-mathematics.org
* 構造主義基本四原則 / four basic principles for constructivism

*** 譯文

    - 在討論構造主義的原則時
      我嘗試區分出 基本哲學原則
      與 僅僅爲方便而設的原則

      四個基本原則凸顯了出來

      (A) 數學即常識

      (B) 別問一個論斷是否真實 除非你明瞭論斷的意思

      (C) 使你信服的論證皆爲證明

      (D) 有意義的區別值得保留

    - 出奇的是
      很多有才能的人 拒絕拒絕在數學中使用常識
      常見的態度是
      數學的形式化價值重大
      因爲形式主義構成了最高法庭
      關於一個證明是否正確的爭論都要在那裏解決
      而相反 嘗試告訴我們
      如果一個證明如此繁雜
      使得我們沒法用非形式化的方式判斷它是否正確
      那麼我們也沒法用形式化的方法檢驗它
      而且 形式主義也不能被用來解決哲學爭論
      因爲形式主義僅僅體現出基礎的哲學
      而哲學爭論必定會上升到形式主義方法的有效性

    - 原則 (B) 解決 構造意義下的真 的問題
      就此而言 它也解決 古典意義下的真 的問題 如果古典主義數學家接受它的話
      我們也許可以說 真 是就約定而言的
      也就是說
      有關任意一個論斷之真假的討論 可能討論雙方都有依據
      這種討論之所以會出現
      就是因爲討論雙方沒有就論斷的意義達成一致
      例如 就如下的問題而言
      "是否 構造主義者相信 不是每個單調有限實數數列都收斂"
      如果我回答 "是"
      ><><><

    - 每當有學生問我 他給出的一個證明是否正確時
      在回答他的問題之前
      我先試着弄清楚 對他而言 證明意味着什麼
      然後我告訴他我的觀點 也就是上面的 原則 (C)
      然後我問他
      他是否徹底信服自己的證明
      又 他是否覺得他已經表達地足夠清晰
      使得別的 充分獲得信息 的智慧生物
      也能徹底信服他的證明

    - 顯然 不接受 原則 (B) 就沒法接受 原則 (C)
      因爲 不明瞭論斷的意義 就談不上信服與否

    - ><><><

    - 古典主義數學家
      沒能發現整數之間的 一種有意義的區別
      這種基本的失敗反映在古典數學發展的各個方面
      設想一個數 n
      定義爲 0 若 黎曼假設爲真
      定義爲 1 若 黎曼假設爲假
      構造主義者無法阻止古典主義數學家使用這類數
      (儘管他個人相信 這類數意義有限)
      然是他的確希望古典主義數學家能夠
      把這類數 和能夠被 "計算" 的數 區分開來
      例如 n1 被定義爲 小於 10^(10^10) 的素數的個數
      古典主義數學家 有時的確會考慮某些數 可否被 "計算"
      但是沒有系統的方法
      在古典數學的系統發展中 這種區別沒能體現出來
      即使他想要觀察
      也沒有工具 能讓古典主義數學家 以系統的方式觀察到這些區別

    - The constructivists are frequently accused of

      ><><><

