docs/source/_posts/translation/schizophrenia-in-contemporary-mathematics.html

<div id="outline-container-orgba87e0f" class="outline-3">
<h3 id="orgba87e0f">原文</h3>
<div class="outline-text-3" id="text-orgba87e0f">
<ul class="org-ul">
<li><p><p></p><p>In discussing the principles of constructivism,</p><p>I shall try to</p><p>separate those aspects of constructivism</p><p>that are basic to the philosophy</p><p>from those that are merely convenient</p><p>(or inconvenient, as the case may be).</p><p></p></p><p></p><p><p></p><p>Four principles stand out as basis:</p><p></p></p><p></p><p><p></p><p>(A) Mathematics is common sense.</p><p></p></p><p></p><p><p></p><p>(B) Do not ask whether a statement is true until you know what it means.</p><p></p></p><p></p><p><p></p><p>(C) A proof is any completely convincing argument.</p><p></p></p><p></p><p><p></p><p>(D) Meaningful distinctions deserve to be maintained.</p><p></p></p></li>

<li><p>Surprisingly</p><p>many brilliant people</p><p>refuse to apply common sense to mathematics.</p><p>A frequent attitude is that</p><p>the formalization of mathematics has been of great value,</p><p>because the formalism constitutes a court of last resort</p><p>to settle any disputes that might arise</p><p>concerning the correctness of a proof.</p><p>Common sense tells us, on the contrary, that</p><p>if a proof is so involved</p><p>that we are unable to determine its correctness by informal methods,</p><p>then we shall not be able to test it by formal means either.</p><p>Moreover the formalism cannot be used to settle philosophical disputes,</p><p>because the formalism merely reflects the basic philosophy,</p><p>and consequently philosophical disagreements</p><p>are bound to result in disagreements about the validity of the formalism.</p></li>

<li><p>Principle (B) resolves the problem of constructive truth.</p><p>For that matter, it would resolve the problem of classical truth</p><p>if the classical mathematicians would accept it.</p><p>We might say that truth is a matter of convention.</p><p>This simply means that all arguments concerning the truth or falsity</p><p>of any given statement about which</p><p>both parties possess the same relevant facts</p><p>occur because they have not reached a clear agreement</p><p>as to what the statement means.</p><p>For instance in response to the inquiry</p><p>"Is it true the construetivists believe that</p><p> not every bounded monotone sequence of real numbers converges?,"</p><p>if I am tired I answer "yes."</p><p>&gt;&lt;&gt;&lt;&gt;&lt;</p></li>

<li><p>Whenever a student asks me whether a proof he has given is correct,</p><p>before answering his question</p><p>I try to discover his concept of what constitutes a proof.</p><p>Then I tell him my own concept, (C) above,</p><p>and ask him whether he finds his argument completely convincing,</p><p>and whether he thinks he has expressed himself clearly enough</p><p>so that other informed and intelligent people</p><p>will also be completely convinced.</p></li>

<li><p>Clearly it is impossible to accept (C) without accepting (B),</p><p>because it doesn't make sense to be convinced that</p><p>something is true unless you know what it means.</p></li>

<li><p>The question often arises,</p><p>whether a constructivist would accept a non-constructive proof</p><p>of a numerical result involving no existential quantifiers,</p><p>such as Goldbach's conjecture</p><p>or Fermat's last theorem.</p><p>My answer is supplied by (C):</p><p>I would want to examine the proof to see</p><p>whether I found it completely convincing.</p><p>Perhaps one should keep an open mind,</p><p>but I find it hard to believe that</p><p>I would find any proof that</p><p>relied on the principle of the</p><p>&gt;&lt;&gt;&lt;&gt;&lt;</p></li>

<li><p>Classical mathematics</p><p>fails to observe meaningful distinctions having to do with integers.</p><p>This basic failure reflects itself</p><p>at all levels of the classical development of mathematics.</p><p>Consider the number n,</p><p>defined to be 0 if the Riemann hypothesis is true</p><p>and 1 if it is false.</p><p>The constructivist does not wish to prevent the classicist from</p><p>working with such numbers</p><p>(although he may personally believe that their interest is limited).</p><p>He does want the classicist to distinguish such numbers</p><p>from numbers which can be "computed".</p><p>such as the number n1 of primes less than 10<sup>(10<sup>10</sup>)</sup>.</p><p>Classical mathematicians do concern themselves sporadically</p><p>with whether numbers can be "computed"</p><p>but only on an ad hoc basis.</p><p>The distinction is not observed</p><p>in the systematic development of classical mathematics,</p><p>nor would the tools available to the classicist</p><p>permit him to observe the distinction systematically</p><p>even if he were so inclined.</p></li>

<li><p>The constructivists are frequently accused of</p><p>displaying the same insensitivity</p><p>to shades of meaning of which they accuse the classicist,</p><p>because they do not distinguish between numbers</p><p>that can be computed in principle, such as the number n defined above,</p><p>and numbers that can be computed in fact.</p><p>Thus they violate their own principle (D).</p><p>This is a serious accusation,</p><p>and one that is not easy to refute.</p><p>Rather than attempting to refute it,</p><p>I shall give you my personal point of view.</p><p>First, it may be demanding too much of the constructivists</p><p>to ask them to lead the way</p><p>in the development of usable and systematic methods</p><p>for distinguishing computability in principle from computability in fact.</p><p>If and when such methods are found,</p><p>the constructivists will gratefully incorporate them</p><p>into their mathematics.</p><p>Second, it is by no means clear that</p><p>such methods are going to be found.</p><p>There is no fast distinction</p><p>between computability in principle and in fact,</p><p>because of the constant progress of</p><p>the state of the art among other reasons.</p><p>The most we can hope for is some good systematic measure</p><p>of the efficiency of a computation.</p><p>Until such is found,</p><p>the problem will continue to be treated on an ad hoc basis.</p></li>

<li><p>I was careful not to call the number nn defined above an integer.Whether we do call it an integer is of no real importance, as long as wedistinguish it in some way from numbers such as n . For instance we mightcall nn an integer and call n a constructive integer. The constructivistshave not accepted this terminology, in part because of Brouwer's influence,but also because it does not accord with their estimate of the relativeimportance of the two concepts. I shall reserve the term "integer11 for what aclassicist might call a constructive integer, and put aside, at least for now,the problem of what would be an appropriate term for what is classicallycalled an integer (assuming that the classical notion of an integer is indeedviable).</p></li>

<li><p>Thus we come to the crucial question, "What is an integer? !l As wehave already seen, the question is badly phrased. We are really looking fora definition of an integer that will be an efficient tool for developing the fullcontent of mathematics. Since it is clear that we always work withrepresentations of integers, rather than integers themselves (whatever those maybe), we are really trying to define what we mean by a representation of aninteger. Again, an integer is represented only when some intelligent agentconstructs the representation, or establishes the convention that some artifactconstitutes a representation. Thus in its final version the question is, "Howdoes one represent an integer? If In practice we shall not be so meticulous asall this in our use of language. We shall simply speak of integers, with theunderstanding that we are really speaking of their representations. Thiscauses no harm, because the original concept of an integer, as somethinginvariant standing behind all of its representations, has just been seen to besuperfluous. Moreover we shall not constantly trouble to point out that</p><p>(representations of) integers exist only by virtue of conventions established bygroups of intelligent beings. After this preliminary chatter, which may seemto have been unnecessary, we present our definition of an integer, dignified bythe title of the</p><p>Fundamental Constructivist Thesis</p><p>Every integer can be converted in principle to decimal form by a finite,purely routine, process.</p></li>

<li><p>Note the phrase "in principle. " It means that although we should beable to program a computer to produce the decimal form of any given integer,</p><p>there are cases in which it would be naive to run the program and wait aroundfor the result.</p></li>

<li><p>Everything else about integers follows from the above thesis plus therules of decimal arithmetic that we learned in elementary school. Twointegers are equal if their decimal representations are equal in the usualsense. The order relations and the arithmetic of integers are defined interms of their decimal representations.</p></li>

<li><p>With the constructive definition of the integers, we have begun our studyof the technical implementation of the constructivist philosophy. Our point ofview is to describe the mathematical operations that can be carried out byfinite beings, man's mathematics for short. In contrast, classicalmathematics concerns itself with operations that can be carried out by God. Forinstance, the above number nn is classically a well-defined integer becauseGod can perform the infinite search that will determine whether the Riemannhypothesis is true. As another example, the smart sequences previouslydiscussed may be able to outwit you and me (or any other finite being), but theywill not be able to outwit God. That is why statement (*) is true classicallybut not constructively.</p></li>

<li><p>You may think that I am making a joke, or attempting to put downclassical mathematics, by bringing God into the discussion. This is not true. I amdoing my best to develop a secure philosophical foundation, based on meaningrather than formalisties, for current classical practice. The most solidfoundation available at present seems to me to involve the consideration of abeing with no n-finite-powers &#x2013; call him God or whatever you will &#x2013;inaddition to the powers possessed by finite beings.</p></li>

<li><p>What powers should we ascribe to God? At the very least, we shouldcredit him with limited omniscence, as described in the following limitedprinciple of omniscence (LPO for short): If [n,} is any sequence of integers,then either tl = 0 for all k or there exists a k with n ^ 0. By acceptingLPO as valid, we are saying that the being whose capabilities our mathematicsdescribes is able to search through a sequence of integers to determinewhether they all vanish or not.</p></li>

<li><p>Let us return to the technical development of constructive mathematics,since it is simpler, and postpone the further consideration of classicalmathematics until later. Our first task is to develop an appropriate language todescribe the mathematics of finite beings. For this we are indebted to</p><p>Brouwer. (See references [l], [6], [l5], [20], and [2l] for a morecomplete exposition that we are able to give here.) Brouwer remarked that themeanings customarily assigned to the terms "and, " "or, ,! "not, " "implies, ""there exists, " and "for all" are not entirely appropriate to the constructivepoint of view, and he introduced more appropriate meanings as necessary.</p></li>

<li><p>The connective "and" causes no trouble. To prove "A and B, " we mustprove A and also prove B, as in classical mathematics. To prove "A or B"we must give a finite, purely routine method which after a finite number ofsteps either leads to a proof of A or to a proof of B. This is very differentfrom the classical use of "or" ; for example, LPO is true classically, but weare not entitled to assert it constructively because of the constructive meaningof "or."</p></li>

<li><p>The connective "implies" is defined classically by taking "A impliesB"to mean "not A or B. " This definition would not be of much valueconstructively. Brouwer therefore defined "A implies B" to mean that there exists anargument which shows how to convert an arbitrary proof of A into a proof ofB. To take an example, it is clear that "{(A implies B) and (B implies C)}implies (A implies C)" is always true constructively; the argument thatconverts arbitrary proofs of "A implies B" and "B implies C" into a proof of"A implies C" is the following: given any proof of A, convert it into a proofof C by first converting it into a proof of B and then converting that proofinto a proof of C.</p></li>

<li><p>We define "not A" to mean that A is contradictory. By this we meanthat it is inconceivable that a proof of A will ever be given. For example,"not 0 = 1" is a true statement. The statement "0 = 1" means that when thenumbers "0" and "1" are expressed in decimal form, a mechanicalcomparison of the usual sort checks that they are the same. Since they are already indecimal form, and the comparison in question shows they are not the same, itis impossible by correct methods to prove that they are the same. Any suchproof would be defective, either technically or conceptually. As anotherexample, "not (A and not A)" is always a true statement, because if we provenot A it is impossible to prove A &#x2013; therefore, it is impossible to proveboth.</p></li>

<li><p>Having changed the meaning of the connectives, we should not besurprised to find that certain classically accepted modes of inference are nolonger correct. The most important of these is the principle of the excluded</p><p>middle &#x2013; "A or not A.!l Constructively, this principle would mean that wehad a method which, in finitely many purely routine steps, would lead to aproof of disproof of an arbitrary mathematical assertion A. Of course wehave no such method, and nobody has the least hope that we ever shall. It isthe principle of the excluded middle that accounts for almost all of theimportant unconstructivities of classical mathematics. Another incorrect principleis "(not not A) implies A.11 In other words, a demonstration of theimpossibility of the impossibility of a certain construction, for instance, does notconstitute a method for carrying out that construction.</p></li>

<li><p>I could proceed to list a more or less complete set of constructivelyvalid rules of inference involving the connectives just introduced. This wouldbe superfluous. Now that their meanings have been established, the rest iscommon sense. As an exercise, show that the statement"(A—&gt;0 = 1)«—*not A"is constructively valid.</p></li>

<li><p>The classical concept of a set as a collection of objects from some pre-existent universe is clearly inappropriate constructively. Constructivemathematics does not postulate a pre-existent universe, with objects lying aroundwaiting to be collected and grouped into sets, like shells on a beach. Theentities of constructive mathematics are called into being by the constructingintelligence. From this point of view, the very question "What is a set? " issuspect. Rather we should ask the question, "What must one do to construct aset? " When the question is posed this way, the answer is not hard to find.</p></li>

<li><p>Definition. To construct a set, one must specify what must be done toconstruct an arbitrary element of the set, and what must be done to prove twoarbitrary elements of the set are equal. Equality so defined must be shown tobe an equivalence relation.</p></li>

<li><p>As an example, let us construct the set of rational numbers. Toconstruct a rational number, define integers p and q and prove that q 4 0. Toprove that the rational numbers p/q and P1/q1 are equal, prove pq. =p.q.</p></li>

<li><p>While we are on the subject, we might as well define a function f: A -* B.It is a rule that to each element x of A associates an element f(x) of B,equal elements of B being associated to equal elements of A.</p></li>

<li><p>The notion of a subset A of a set A is also of interest. To constructan element of A , one must first construct an element of A , and then provethat the element so constructed satisfies certain additional conditions,characteristic of the particular subset A . Two elements of A are equal if theyare equal as elements of A .</p></li>

<li><p>Contrary to classical usage, the scope of the equality relation neverextends beyond a particular set. Thus it does not make sense to speak ofelements of different sets as being equal, unless possibly those different sets areboth subsets of the same set. This is because for the constructivist equalityis a convention, whose scope is always a given set; all this is conceptuallyquite distinct from the classical concept of equality as identity. You see nowwhy the constructivist is not forced to resort to the artifice of equivalenceclasses!</p></li>

<li><p>After this long digression, consider again the quantifiers. Let A(x) bea mathematical assertion depending on a parameter x ranging over a set S.To prove !l V xA(x), n we must give a method which to each element x of Sassociates a proof of A(x). Thus the meaning of the universal quantifier !IV !lis essentially the same as it is classically.</p></li>

<li><p>We expect the existential quantifier !l3,!l on the other hand, to have anew meaning. It is not clear to the constructivist what the classicist meanswhen he says "there exists." Moreover, the existential quantifier is just aglorified version of "or, !l and we know that a reinterpretation of thisconnective was necessary. Let the variable x range over the set S. Then to prove!l3xA(x)n we must construct an element xn of S, according to the principleslaid down in the definition of S , and then prove the statement ,!A(xn). !l</p></li>

<li><p>Again, certain classical uses of the quantifiers fail constructively. Forexample, it is not correct to say that "not V xA(x) implies 3 x not A(x). "On the other hand, the implication "not 3 xA(x) implies V x not A(x)" isconstructively valid. I hope all this accords with your common sense, as itdoes with mine.</p></li>

<li><p>Perhaps you see an objection to these developments &#x2013; that they appearto violate constructivist principle (D) above. By accommodating ourterminology to the mathematics of finite beings, have we not replaced the classicalsystem, that does not permit the systematic development of constructivemeaning, by a system that does not permit the systematic development of classicalmeaning? In my opinion the exact opposite is true &#x2013; the constructive</p><p>terminology just introduced affords as good a framework as is presentlyavailable for expressing the content of classical mathematics.</p></li>

<li><p>If you wish to do classical mathematics, first decide what non-finiteattributes you are willing to grant to God. You may wish to grant him LPOand no others. Or you may wish to be more generous and grant him EM, theprinciple of the excluded middle, possibly augmented by some version of theaxiom of choice. When you have made your decision, avail yourself of all theapparatus of the constructivist, and augment it by those additional powers(LPO or EM or whatever) that you have granted to God. Although you will beable to prove more theorems than the constructivist will, because your beingis more powerful than his, his theorems will be more meaningful than yours.Moreover to each of your theorems he will be able to associate one of his,having exactly the same meaning. For example, if LPO is the only non-finiteattribute of your God, then each of your theorems !IA!I he will restate and</p><p>prove as !lLPO implies A.!l Clearly the meaning will be preserved. On theother hand, if he proves a theorem "B, " you will also be able to prove !IB,!lbut your !IB!I will be less meaningful than his. The classical interpretation ofeven such simple results as Goldbach's conjecture is weaker than theconstructive interpretation. In both cases the same phenomena &#x2013; the results ofcertain finitely performable computations &#x2013; are predicted, but the degree ofconviction that the predicted phenomena will actually be observed is greater inthe constructive case, because to trust the classical predictions one mustbelieve in the theoretical validity of the concept of a God having the specifiedattributes, whereas to trust the constructive predictions one must only believein the theoretical validity of the concept of a being who is able to performarbitrarily involved finite operations.</p></li>

<li><p>It would thus appear that even a constructive proof of such a result asflthe number of zeros in the first n digits of the decimal expansion of tt doesnot exceed twice the number of ones11 would leave us in some doubt as towhether the prediction is correct for any particular value of n, say for n =1000. We have brought mathematics down to the gut level. My gut tells meto trust the constructive prediction and be wary of the classical prediction. Isee no reason that yours should not tell you to trust both, or to trust neither.</p></li>

<li><p>In common with other constructivists, I also have gut feelings about therelative merits of the classical and constructive versions of those resultswhich, unlike Goldbach's conjecture, assert the existence of certain quantities.</p><p>If we let "A" be any such result, with the constructive interpretation, then theconstructive version of the corresponding classical result will be (forinstance) "LPO -* A, " as we have seen. My feeling is that is likely to beworth whatever extra effort it takes to prove "A11 rather than "LPO -» A. "</p></li>

<li><p><p></p><p>The linguistic developments I have outlined could be taken as the basisfor a formalization of constructive (and therefore of classical) mathematics.So as not to create the wrong impression, I wish to emphasize again certainpoints that have already been made.</p><p></p></p><p></p><p><p></p><p>FormalismThe devil is very neat. It is his prideTo keep his house in order. Every bitOf trivia has its place. He takes great painsTo see that nothing ever does not fit.And yet his guests are queasy. All their food,Served with a flair and pleasant to the eye,Goes through like sawdust. Pity the perfect host!The devil thinks and thinks and he cannot cry.</p><p></p></p><p></p><p><p></p><p>ConstructivismComputation is the heartOf everything we prove.Not for us the velvet wisdomOf a softer love.If Aphrodite spends the night,Let Pallas spend the day.When the sun dispels the starsPut your dreams away.</p><p></p></p></li>

<li><p>There are at least two reasons for developing formal systems forconstructive mathematics. First, it is good to state as concisely andsystematically as we are able some of the objects, constructions, terminology, andmethods of proof. The development of formal systems that catch these aspectsof constructive practice should help to sharpen our understanding of how bestto organize and communicate the subject. Second and more important,informal mathematics is the appropriate language for communicating withpeople, but formal mathematics is more appropriate for communicating withmachines. Modern computer languages (see the report [30], for example),while rich in facilities, seem to be lacking in philosophical scope. It might beworthwhile to investigate the possibility that constructive mathematics would</p><p>afford a solid philosophical basis for the theory of computation, andconstructive formalism a point of departure for the development of a better computerlanguage. Certainly recursive function theory, which has played a centralrole in the philosophy of computation, is inadequate to the task.</p></li>

<li><p>The development of a constructive formalism at any given level wouldseem to be no more difficult than the development of a classical formalism atthe same level. See [17], [18], [20], [2l], [22], and [27] for examples.For a discussion of constructive formalism as a computer language, see [2] .</p></li>

<li><p>Let us return to the technical development of constructive mathematics,and ask what is meant constructively by a function f: 7Z ~* 7Z (where Z is theset of integers). We improve the classical treatment right away - instead oftalking about ordered pairs, we talk about rules. Our definition takes afunction F: Z -» 2 to be a rule that associates to each (constructively defined)integer n a (constructively defined) integer f(n), equal values beingassociated to equal arguments. For a given argument n, the requirement that f(n)be constructively defined means that its decimal form can be computed by afinite, purely routine process. That's all there is to it. Functions f: Z -* Q,f: Q-»Q, f: Z -» Q are defined similarly. (Here Q is the set of rational+ +numbers and Z the set of positive integers.) A function with domain Z iscalled a sequence, as usual.</p></li>

<li><p>Now that we know what a sequence of rational numbers is, it is easy todefine a real number. A real number is a Cauchy sequence of rationalnumbers! Again, I have improved on the classical treatment, by not mentioningequivalence classes. I shall never mention equivalence classes. To be surewe completely understood this definition, let us expand it a bit. Real numbersare not pre-existent entities, waiting to be discovered. They must beconstructed. Thus it is better to describe how to construct a real number, thanto say what it is. To construct a real number, one must(a) construct a sequence {x } of rational numbers,n(b) construct a sequence {N } of integers,n(c) prove that for each positive integer n we have1 |x. - x. I £ — whenever i ^ N and j J ^ N .i J1 n n nOf course, the proof (c) must be constructive, as well as the constructions (a)and (b).</p></li>

<li><p>Two real numbers [a } and {b } (the corresponding convergencen nparameters (b) and proofs (c) are assumed without explicit mention) are saidto be equal if for each positive integer k there exists a positive integer N1such that la -b I ^r whenever n &lt;* N. . It can be shown that this notion1 n n* k kof equality is an equivalence relation. Addition and multiplication of realnumbers are also defined in the same way as they are defined classically.The order relation, on the other hand, is more interesting. If a = {a } andnb = {b } are real numbers, we define a &lt; b to mean that there exist posi-n1tive integers 6 M and N such that a £ b - — whenever n ^ N. Then it isn n Measily shown that a &lt; b and b &lt; c imply a &lt; c, that a &lt; b impliesa - c &lt; b - c, and so forth. Some care must be exercised in defining therelation £ We could define a £ b to mean that either a &lt; b or a = b. An.alternate definition would be to define it to mean that b &lt; a is contradictory.We shall not use either of these, although our definition turns out to beequivalent to the latter.</p></li>

<li><p>DEFINITION, a £ b means that for each positive integer M there existsa positive integer N such that b ^ a - — whenever n ^ N.</p></li>

<li><p>To make the choice of this definition plausible, I shall construct acertain real number HH- I a 2n= 1where a = 0 in case every even integer between 4 and n is the sum of twon nprimes, primes, r and and a a = =1 1 otherwise. o1 (More precisely, H is given by the Cauchynsequence [a^} , withn</p><p>a = / a.*k=land the sequence {N } of convergence parameters, where N = n. ) Clearlyn nwe wish to have H ^ 0. It certainly is according to the definition we havechosen. (The real number 0 of course is the Cauchy sequence of rationalnumbers all of whose terms are 0.) On the other hand, we would not beentitled to assert that H £ 0 if we had defined H ^ 0 to mean that either H&gt; 0or H = 0, because the assertion f,H&gt; 0 or H = 0" means that we have afinite, purely routine method for deciding which; in this case, a finite, purely</p><p>routine method for proving or disproving Goldbach's conjecture!</p></li>

<li><p>Most of the usual theorems about ^ and &lt; remain true constructively,with the exception of trichotomy. Not only does the usual form !la &lt; b ora = b or a &gt; b11 fail, but such weaker forms as "a &lt; b or a ^ b,,f or even!,a ^ b or a ^ b11 fail as well. For example, we are not entitled to assert"0 &lt; H or 0 = H or 0 &gt; H.!l If we consider the closely related numberH'= 1 &lt;*, '2n &lt;-2fn .n= -i 1we are not even entitled to assert that "H* ^ 0 or H £ 0. !l</p></li>

<li><p>Since trichotomy is so fundamental, we might expect constructivemathematics to be hopelessly enfeebled because of its failure. The situation issaved, because trichotomy does have a constructive version, which of courseis considerably weaker than the classical.</p></li>

<li><p>THEOREM. For arbitrary real numbers a, b, and c, with a &lt; b,either c &gt; a or c &lt; b.</p><p>PROOF. Choose integers M and Nrt such that a £ b - t-t whenever0 n n Mn ^ N_ . Choose integers &amp; N , N, , and N such that la ' -a I £ (6M)~0 a b c n m1whenever n, m<sup>N</sup>, lb -b I £ (6M) whenever n,m ^ N, , |c -c I £an m' b n m'(6M) whenever n, m ^ N . Set N = max{NA, N , N, , N } . Since a_.,c 0 a d c JNbN, and cN are all rational numbers, eitherCN&lt;i(aN+V °r CN*2(aN+V •.Consider first the case cN ^ T<sup>aN</sup> + bN^' Since aN ^ bKr " M" » <b>* followsthat aN £ - (2M) . For each n £ N we therefore havecN</b> + (6M)1 * " (2M)^ + (6M)1an aN CN£c + (6M)"1 - (ZM)"1^-(6M)"1= c - (6M)"1 .n nTherefore, a &lt; c. In the other case, cN &lt; -r (aN + bN), it follows similarlythat c &lt; b. This completes the proof of the theorem.</p></li>

<li><p>Do not be deceived by the use of the word "choose11 in the above proof,which is simply a carry-over from classical usage. No choice is involved,</p><p>because M and N , for instance, are fixed positive integers, definedexplicitly by the proof of the inequality a &lt; b. Of course we could decide tosubstitute other values for the original values of M and N , if we desired, sosome choice is possible should we wish to exercise it. If we do not explicitlystate what choice we wish to make, it will be assumed that the values of Mand N given by the proof of a &lt; b are chosen.</p></li>

<li><p>The number H, which is constructively a well-defined real number, isclassically rational, because if the Goldbach conjecture is true then H = 0,and if the conjecture is false then H = 2 , where n is the first eveninteger for which it fails. We are not entitled to assert constructively that His rational: if it is rational, then either H = 0 or H/0, meaning that eitherGoldbach1 s conjecture is true or else it is false; and we are not entitled toassert this constructively, until we have a method for deciding which. We arenot entitled to assert H is irrational either, because if H is irrational, thenH 4 0, therefore Goldbach!s conjecture is false, therefore H is the rationalnumber 2 , a contradiction! Thus H cannot be asserted to be rational,although its irrationality is contradictory. (I am indebted to Halsey Roydenfor this amusing observation.)</p></li>

<li><p>It is easy to prove the existence of many irrational numbers, by provingthe uncountability of the real numbers, as a corollary of the Baire categorytheorem. For the present, let us merely remark that \TI is irrational. Ofcourse, can be defined by constructing successive decimalapproximations. It is therefore constructively well-defined. The classical proof of theirrationality of n/T shows that if p/q is any rational number then p/q 4 2.Since both p /q and 2 can be written with denominator q , it follows that2-VTI q I . I 12+VT| q = V2 1q qSince clearly p/q 4 <b>J~Z in case p/q &lt; 0 or p/q &gt; 2 , to show that p/q 4 n/Twe may assume 0 £ p/q £ 2 . Then'I ' '</b> ' q2 q2 4q2Therefore, n/T 4 p/q. Thus 'v/T is (constructively) irrational.</p></li>

<li><p>The failure of the usual form of trichotomy means that we must becareful in defining absolute values and maxima and minima of real numbers. For</p><p>example, if x = (x ] is a real number, with sequence [N } of convergencen nparameters, then |x| is defined to be the Cauchy sequence [|x |} ofrational numbers (with sequence {N } of convergence parameters). Similar-nooly, min(x,y} is defined to be the Cauchy sequence (min(xn»yn<sup>n</sup>=i » andmax[x,y} to be [maxfx , y }} . .n n n-i</p></li>

<li><p>This definition of min, in particular, has an amusing consequence.Consider the equationx2 - xH' = 0 .Clearly 0 and the number H* are solutions. Are they the only solutions? Itdepends on what we mean by "only.11 Clearly min{0, H*} is a solution, andwe are unable to identify it with either 0 or H' . Thus it is a third solution!The reader might like to amuse himself looking for others. This discussionincidentally makes the point that if the product of two real numbers is 0 weare not entitled to conclude that one of them is 0. (For example, x(x-H') = 0does not imply that x = 0 or x - H' = 0: set x = min { 0, H'} .)</p></li>

<li><p>The constructive real number system as I have described it is notaccepted by all constructivists. The intuitionists and the recursive functiontheorists have other versions.</p></li>

<li><p>For Brouwer, and his followers (the intuitionists), the constructive realnumbers described above do not constitute all of the real number system. Inaddition there are incompletely determined real numbers, corresponding tosequences of rational numbers whose terms are not specified by a masteralgorithm. Such sequences are called "free-choice sequences, l! because thecreating subject, who defines the sequence, does not completely commithimself in advance but allows himself some freedom of choice along the way indefining the individual terms of the sequence.</p></li>

<li><p>There seem to be at least two motivations for the introduction of free-choice sequences into the real number system. First, since each constructivereal number can presumably be described by a phrase in the English language,on superficial consideration the set of constructive real numbers would appearto be countable. On closer consideration this is seen not to be the case:Cantor's uncountability theorem holds, in the following version. If {x } isnany sequence of real numbers, there exists a real number x with x/x fornall n. Nevertheless it appears that Brouwer was troubled by a certain aura ofthe discrete clinging to the constructive real number system IR. Second,</p><p>every function anyone has ever been able to construct from R to R hasturned out to be continuous, in fact uniformly continuous on bounded subsets.(The function f that is 1 for x £ 0 and 0 for x &lt; 0 does not count, becausefor those real numbers x for which we have no proof of the statement "x ^ 0,or x &lt; 0fl we are unable to compute f(x).) Brouwer had hopes of proving thatevery function from R to R is continuous, using arguments involving freechoice sequences. He even presented such a proof [7] . It is fair to say thatalmost nobody finds his proof intelligible. It can be made intelligible byreplacing Brouwer !s arguments at two critical points by axioms, that Kleene andVesley [21] call "Brouwer's principle11 and !*the bar theorem.I! My objectionto this is, that by introducing such a theorem as !lall f : R -» R arecontinuous11 in the guise of axioms, we have lost contact with numerical meaning.Paradoxically this terrible price buys little or nothing of real mathematicalvalue. The entire theory of free-choice sequences seems to me to be made ofvery tenuous mathematical substance.</p></li>

<li><p>If it is fair to say that the intuitionists find the constructive concept of asequence generated by an algorithm too precise to adequately describe the realnumber system, the recursive function theorists on the other hand find it toovague. They would like to specify more precisely what is meant by analgorithm, and they have a candidate in the notion of a recursive function. Theyadmit only sequence of integers or rational numbers that are recursive (aconcept we shall not define here: see [20] for details). Their reasons are, thatthe concept is more precise than the naive concept of an algorithm, that everynaively defined algorithm has turned out to be recursive, and it seems unlikelywe shall ever discover an algorithm that is not recursive. This requirementthat every sequence of integers must be recursive is wrong on threefundamental grounds. First and most important, there is no doubt that the naiveconcept is basic, and the recursive concept derives whatever importance it</p><p>has from some presumption that every algorithm will turn out to be recursive.Second, the mathematics is complicated rather than simplified by therestriction to recursive sequences. If there is any doubt as to this, it can beresolved by comparing some of the recursivist developments of elementaryanalysis with the constructivist treatment of the same material. Even if one isoriented to running material on a computer, the recursivist formulation wouldconstitute an obstacle, because very likely the recursive presentation wouldbe translated into computer language by first translating into common</p><p>constructive terminology (at least mentally) and then translating that into thelanguage of whatever computer was being used. Third, no gain in precision isactually achieved. One of the procedures for defining the value of a recursivefunction is to search a sequence of integers one by one, and choose the firstthat is non-zero, having first proved that one of them is non-zero. Thus thenotion of a recursive function is at least as imprecise as the notion of acorrect proof. The latter notion is certainly no more precise than the naivenotion of a (constructive) sequence of integers.</p></li>

<li><p>The desire to achieve complete precision, whatever that is, is doomedto frustration. What is really being sought is a way to guarantee that nodisagreements will arise. Mathematics is such a complicated activity thatdisagreements are bound to arise. Moreover, mathematicians will always betempted to try out new ideas that are so complicated or innovative that theirmeaning is questionable. What is important is not to develop some framework,such as recursive function theory, in the vain hope of forestalling questionableinnovations, but rather to subject every development to intense scrutiny (interms of the meaning, not on formal grounds).</p></li>

<li><p>Recursive functions come into their own as the source of certaincounter-examples in constructive mathematics, the most famous being theword-problem in the theory of groups. Since the concept of a (constructively)recursive sequence is narrower than the concept of a (constructive) sequence,it is easier to demonstrate that there exist no recursive sequences satisfyinga given condition G. Such a demonstration makes it extremely unlikely that a(constructive) sequence satisfying G will be found without some radically newmethod for defining sequences being discovered, a discovery that many viewas almost out of the question.</p></li>

<li><p>Although some very beautiful counter-examples have been given bymeans of recursive functions, they have also been used as a source ofcounterexamples in many situations in which a prior technique due to Brouwer [20]would have been both simpler and more convincing. Brouwer !s idea is tocounter-example a theorem A by proving A -* LPO. Since nobody seriouslythinks LPO will ever be proved, such a counter-example affords a goodindication that A will never be proved. As an instance, Brouwer has shown thatthe statement that every bounded monotone sequence of real numbersconverges implies LPO.</p></li>

<li><p>Another source of Brouwerian counter-examples is the statement LLPO(for the !llesser limited principle of omniscience11), that if {n, } is anysequence of integers, then either the first non-zero term, if one exists, is evenor else the first non-zero term, if one exists, is odd. Clearly LPO -* LLPO,but there seems to be no way to prove that LLPO -» LPO. Nevertheless, weare just as sceptical that LLPO will ever be proved. Thus A -* LLPO isanother type of Brouwerian counter-example for A. As an instance, thestatement that "either x2:0 or x £ 0 for each real number x11 impliesLLPO, in fact is equivalent to it.</p></li>

<li><p>Thus we are so sceptical that the statements LPO, LLPO, and their ilkwill ever be proved that we use them for building counter-examples. Thestrongest counter-example to A would be to show that a proof of A isinconceivable, in other words to prove !,not A, !l but proving "A -* LPO11 or11A ■* LLPO11 is almost as good. In fact, I personally find it inconceivablethat LPO (or LLPO for that matter) will ever be proved. Nevertheless Iwould be reluctant to accept !*not LPO11 as a theorem, because my belief inthe impossibility of proving LPO is more of a gut reaction prompted byexperience than something I could communicate by arguments I feel would be sureto convince any objective, well-informed, and intelligent person. Theacceptance of lfnot LPO11 as a theorem would have one amusing consequence, that thetheorems of constructive mathematics would not necessarily be classicallyvalid (on a formal level) any longer. It seems we are doomed to live with!lLPO!l and !,there exists a function from [0, 1] to R that is not uniformlycontinuous'1 and similar statements, of whose impossibilities we are not quitesure enough to assert their negations as theorems.</p></li>

<li><p>The classical paradoxes are equally viable constructively, the simplestperhaps being "this statement is false. " The concept of the set of all setsseems to be paradoxical (i.e., lead to a contradiction) constructively as wellas classically. Informed common sense seems to be the best way of avoidingthese paradoxes of self reference. Their spectre will always be lurking overboth classical and constructive mathematics. Hermann Weyl made themeticulous avoidance of self reference the basis of a whole new development of thereal number system (see Weyl [32] ) that has since become known aspredicative mathematics. Weyl later abandoned his system in favor of intuitionism.I see no better course at present that to recognize that certain concepts are</p><p>inherently inconsistent and to familiarize oneself with the dangers of self-reference.</p></li>

<li><p>Not only is there insufficient time, but I would not be competent toreview all of the recent advances of constructive mathematics, including thoseof ad hoc constructivism as well as those taking place under constructivistphilosophies at variance with those that I have presented here, for examplethe recursivist constructivism of Markov and his school in Russia. (I havebeen told that some of the recent advances in differential equations have tendedto present that subject in a more constructive light. Perhaps Felix Browderwill give us some information about those developments.) I shall restrictmyself in what remains to selected developments with which I am familiar, thatseem to me to be of special interest.</p></li>

<li><p>Brouwer [6] was the first to develop a constructive theory of measureand integration, and the intuitionist tradition (see [19] and [31] for instance)in Holland carried the development further, working with Lebesgue measureon R . In [1] I worked with arbitrary measures (both positive and negative)on locally compact spaces, recovering much of the classical theory. TheDaniell integral was developed in full generality in [5]. The concept of anintegration space postulates a set X, a linear subset L of the set of allpartially-defined functions from X to R, and a linear functional I from Lto R having the properties</p><p>(1) if f € L, then |f| € L and min {f, 1 } € L(2) if f € L and f € L for each n, ' such that f * 0 and» n n£ , 1(f) converges to a sum that is less than 1(f), thenE . f (x) converges and is less than f(x), for some x in the commonn— i ndomain of f and the functions fn(3) I(p) 4 0 for some p € L(4) lim Krnin {f,n}) = 1(f) and lim Kmin { |f | , n"1 }) = 0 forn-»® n-&gt; »all fin L,We define L^ to consist of all partially defined functions f from Xto R such that there exists a sequence ff } of elements of L such thatn(a) E . K|f | ) converges and (b) Z* f (x) = f(x) whenever Z°° , |f (x)|n—i n n-i n n=i nconverges.</p></li>

<li><p>It turns out to be possible to extend I to L in such a way that(X, L. , I) also satisfy the axioms, and in addition L. is complete under themetric p(f,g) = I(|f-g|).</p></li>

<li><p>The only real problem in recovering the classical Daniell theory isposed by the classical result that if f € L then the set A = f x € X: f(x) 2&gt;t]is integrable for all t &gt; 0 (in the sense that its characteristic function x ,defined by xtW = 1 if f(x) * t and xfcfe) = 0 if f(x) &lt; t, is in 1^). Theconstructive version is that A is integrable for all except countably manyt &gt; 0. The proof of this requires a rather complex theory, called the theoryof profiles. Y. K. Chan informs me that he has been able to simplify thetheory of profiles considerably. He has also effected a considerablesimplification in another trouble-spot of [5], the proof that a non-negative linearfunctional I on the set L. = C(X) of continuous functions on a compact spaceX satisfies the axioms for an integration space presented above. (Axiom (2)is the troublemaker•)</p></li>

<li><p>Constructive integration theory affords the point of departure for somerecent constructivizations of parts of probability theory. There is no(constructive) way to prove even the simplest cases of the ergodic theorem,such that if T denotes rotation of a circle X through an angle df then foreach integrable function f: X -* R and almost all x in X, the averagesN*nW = Tf 2 <b>(Tn</b>)n= 1converge. (The difficulty comes about because we are unable to decide forinstance whether a = 0.) One way to recover the essence of the ergodictheorem constructively, and in fact deepen it considerably, is to show that thesequence {fN } satisfies certain integral inequalities, analogous to the up-crossing inequalities (see [14]) of martingale theory. This was done in thecontext of the Chacon-Ornstein ergodic theorem in [1], and even moregenerally in [3].</p></li>

<li><p>John Nuber [23] takes another route, He presents sufficient conditions,close to being necessary, that the sequence {*N} actually converges a. e., inthe context of the classical Birkhoff ergodic theorem. More recently, in anunpublished manuscript, he has generalized his conditions to the context of theclassical Chacon-Ornstein theorem.</p></li>

<li><p>Y. K. Chan has done much to constructivize the theory of stochasticprocesses. His paper [lO] unifies the two classically distinct cases of therenewal theorem into one constructive result. His paper [l2] contains thefollowing theorem:</p></li>

<li><p>THEOREM. Let p, and [X ~ be probability measures on R, and f.and f? their characteristic functions (Fourier transforms). Let g be acontinuous function on R, with |g| £ 1. Then for every e &gt; 0 there exist6 &gt; 0 and 9 &gt; 0, depending only on c and the moduli of continuity of f., i~,and g, such thatl/gdU^/gdu<sup>cwhenever</sup> |f -fJ&lt;6 on [-6,4].</p></li>

<li><p>A simple corollary is Levy's theorem, that if [\i } is a sequence ofprobability measures on iR, whose characteristic functions {f } convergeuniformly on compact sets to some function f , then \X converges weakly toa probability measure M whose characteristic function is f</p></li>

<li><p>Levy's theorem is classically an important tool for provingconvergence of measures. Chan shows that this is also true constructively, by usingit to get constructive proofs of the central limit theorem and of the Levy-Khintchine formula for infinitely divisible distributions.</p></li>

<li><p>Chan's papers [9] and [ll] are primarily concerned with the problemof constructing a stochastic process. In [9] he gives a constructive versionof Kolmogorov's extension theorem. In [ll], he constructivizes the classicalderivation of a time homogeneous Markov process from a strongly continuoussemi-group of transition operators. In addition he proves Ionescu Tulcea'stheorem and a super martingale convergence theorem.</p></li>

<li><p>H. Cheng [l3] has given a very pretty version of the Riemann mappingtheorem and Caratheodory's results on the convergence of mapping functions.He defines a simply connected proper open subset U of the complex plane Cto be mappable relative to some distinguished .point z of U if for each€ &gt; 0 there exist finitely many points z , . . . , z in the complement of U1 nsuch that any continuous path beginning at z and having distance ^ e fromeach of the points z , . . ., z lies entirely in U . He shows that mappabilityis necessary and sufficient for the existence of a mapping function. He goeson to study the dependence of the mapping function on the domain, by defining</p><p>natural metrics on the space D of domains (with distinguished points zQ) andthe space M of mapping functions, and proving that the function X * D -* Mthat associates to each domain its mapping function is a homeomorphism. Hethus extends and constructivizes the classical Caratheodory results. Many ofhis estimates are similar to those developed by Warschawski in his studies ofthe mapping function.</p></li>

<li><p>The problem of constructivizing the classical theory of uniformizationis still open. (Even reasonable conjectures seem difficult to come by. ) So isthe problem of (constructively) constructing canonical maps for multiplyconnected domains, as far as I know.</p></li>

<li><p>It is natural to define two sets to have the same cardinality if they arein one-one correspondence. The constructive theory of cardinality seemshopelessly involved, due to the constructive failure of the Cantor-Bernsteinlemma, and for other reasons as well.</p></li>

<li><p>Progress has been made however in constructivizing the theory ofordinal numbers. Brouwer [8] defines ordinals to be ordered sets that arebuilt up from non-empty finite sets by finite and countable addition.F. Richman [26] gives a more general definition. Simple in appearance, hisdefinition constructivizes the property of induction in just the right way. Anordinal number (or well-ordered set) is a set S with a binary relation &lt; suchthat(1) if a &lt;b and b &gt; c, then a &lt; c(2) one and only one of the relations a&lt;b, b&lt;a, a=b holds for givenelements a and b of S(3) let T be any subset of S with the property that every element b ofS, such that a € T for each a in S with a &lt; b, belongs to T; thenT =S.</p></li>

<li><p>Richman shows that each Brouwerian ordinal satisfies (1), (2), and (3).He gives examples of ordinals (in his sense) that are not Brouwerian. Heshows that every subset of an ordinal is an ordinal (under the induced order).He uses his theory to constructivize the classical theorems of Zippin and Ulmconcerning existence and uniqueness of p-groups with prescribed invariants.</p></li>

<li><p>The above examples might give the impression that the constructiviza-tion of classical mathematics always proceeds smoothly. I shall now givesome other examples, to show that in fact it does not.</p></li>

<li><p>In [l] the Gelfand theory of commutative Banach algebras was con-structivized to a certain extent. The theory has to be consideredunsatisfactory, not because the classical content is not recovered (it is), but becauseit is so ugly. It is almost certain that a prettier constructivization willsomeday be found.</p></li>

<li><p>Stolzenberg [28] gives a meticulous analysis of some of theconsiderations involved in constructivizing a particular classical theory, the openmapping theorem and related material. Again, an incisive constructivization isnot obtained.</p></li>

<li><p>J. Tennenbaum [29] gives a deep and intricate constructive version ofHilbert's basis theorem. Consider a commutative ring A with unit. It wouldbe tempting to call A (constructively) Noetherian if for each sequence {a }of elements of A there exists an integer N such that for n ^ N the elementa is a linear combination of a.,.. •, a . with coefficients in A. Thisn 1 n-1notion would be worthless &#x2013; not even the ring of integers is Noetherian in thissense. In case A is discrete (meaning that the equality relation for A isdecidable), the appropriate constructive version of Noetherian seems to be thefollowing (as given in [29]).</p></li>

<li><p>DEFINITION. A sequence {a } of elements of A is almosteventually zero if for each sequence {n. } of positive integers there exists apositive integer k such that a =0 for k £ n £ k + 11, .DEFINITION. A basis operation r for A is a rule that to each finitesequence a , . . . ,a of elements of A assigns an element r(a_, . . . ,a ) ofIn InA of the form a + \,a. + • • • + X ,a ,, where each X. belongs to A.nil n-l n-i 1DEFINITION. A is Noetherian if it has a basis operation r such thatfor each sequence {a } of elements of A the associated sequence£r (a , . . . , a ) } is almost eventually zero.1 n</p></li>

<li><p>Tennenbaum proved the appropriateness of his version of Noetherian bychecking out the standard cases and proving the Hilbert basis theorem. Healso extended his definition and results to the case of a not-necessarilydiscrete ring A. The theory in that case is so complex that it cannot beconsidered satisfactory.</p></li>

<li><p>In spite of the pioneering efforts of Kronecker, and continued work bymany algebraists, resulting in many deep theorems, the systematic</p><p>constructivization of algebra would seem hardly to have begun. The problemsare formidable. A very tentative suggestion is that we should restrict ourattentions to algebraic structures endowed with some sort of topology, withrespect to which all operations and maps are continuous. The work ofTennenbaum quoted above might provide some ideas of how to accomplish this.The task is complicated by the circumstance that no completely suitableconstructive framework for general topology has yet been found.</p></li>

<li><p>The constructivization of general topology is impeded by two obstacles.First, the classical notion of a topological space is not constructively viable.Second, even for metric spaces the classical notion of a continuous function isnot constructively viable; the reason is that there is no constructive proof thata (pointwise) continuous function from a compact (complete and totally bounded)metric space to R is uniformly continuous. Since uniform continuity forfunctions on a compact space is the useful concept, pointwise continuity (nolonger useful for proving uniform continuity) is left with no useful function toperform. Since uniform continuity cannot be formulated in the context of ageneral topological space, the latter concept also is left with no usefulfunction to perform.</p></li>

<li><p>In [l] I was able to get along by working mostly with metric spaces andusing various ad hoc definitions of continuity: one for compact spaces,another for locally compact spaces, and another for the duals of Banach spaces.The unpublished manuscript [4] was an attempt to develop constructive generaltopology systematically. The basic idea is that a topological space shouldconsist of a set X, endowed with both a family of metrics and a family of bound-edness notions, where a boundedness notion on X is a family S of subsetsof X (called bounded subsets), whose union is X, closed under finite unionsand the formation of subsets.</p></li>

<li><p>For example, let C be the set of all real valued functions f: R -* R ,bounded and (uniformly) continuous on finite intervals. Each finite intervalof R induces a metric on C (the uniform metric on that interval). Inaddition, there is a natural boundedness notion S. A subset E of C belongs toS if there exists r&gt;0 such athat |f| ^ r for all f in E. A sequence {f }of elements of C converges to an element f of C if it converges withrespect to each of the metrics on C, and if it is bounded.</p></li>

<li><p>The notion of a continuous function from one such space to another, asgiven in [4] , is somewhat involved and will not be repeated here. It was</p><p>possible to develop a theory that seems to accommodate the known examplesand to have certain pleasing functorial qualities, but the theory is somehow notconvincing &#x2013; for one thing, it is too involved. For another, there is a certainsort of space &#x2013; let us call it a ball space &#x2013; that does not fit well into thetheory.</p></li>

<li><p>DEFINITION. A ball space is a set X, together with a function that toeach r ^ 0 and point x of X associate a subset B(x, r) of X (to be thoughtof as the closed ball of radius r about x) satisfying the following axioms.(a) B(x,r) c B(x, s) if r £ s .(b) B(x,0) = {x}.(c) B(x.r) = 0 [B(x, s): s&gt;r} .(d) If y € B(x,r), then x S B(y,r) .(e) If y € B(x,r) and z € B(y, s), then z € B(x, r+s).(f) U {B(x,r): r * 0} = X .</p></li>

<li><p>Duals of Banach spaces are particular instances of ball spaces, as arevarious other function spaces.</p></li>

<li><p>Algebraic topology, at least at the elementary level, should not be toodifficult to constructivize. There is a problem with defining singular co-homology constructively, as pointed out in [2], Richman [25] points out thatthe classical Vietoris homology theory is not satisfactory constructively, andhe gives a new version that constructively (and also classically) has certainfeatures that are more desirable.</p></li></ul>
</div>
</div>
</div>
