translation/schizophrenia-in-contemporary-mathematics.org
* 總結 / conclude

*** 譯文

    * ><

*** 原文

    * I would like to conclude these lectures by discussing some of the tasksthat face constructive mathematics.

    * Of primary importance is the systematic constructive development ofenough of algebra for a pattern to begin to emerge. Of course, it may be thatmuch of the classical theory is inherently unconstructivizable, and thatconstructive algebra will go its own way. It is too early to tell.

    * Less critical, but also of interest, is the problem of a convincingconstructive foundation for general topology, to replace the ad hoc definitions incurrent use. It would also be good to see a constructivization of algebraictopology actually carried through, although I suspect this would not pose thecritical difficulties that seem to be arising in algebra.

    * To sum up, the first task is to constructivize as much of existingclassical mathematics as is suitable for constructivization. As this is being
      done, we should increasingly turn our attention to questions of the efficiency ofour algorithms, and bridge the gap between constructive mathematics on theone hand and numerical analysis and the theory of computation on the other.Since constructive mathematics is the study of what is theoreticallycomputable, it should afford a sound philosophical basis for the theory ofcomputation.

    * Our terminology and technical devices need constant re-examination asto whether they are the most appropriate tools for extracting the full meaningfrom our material. It seems to me that the meaning of implication, inparticular, should be thoroughly studied, and other possible candidatesinvestigated. Such statements as "(A -* B) -* C" have a rather tenuous meaning, andin many instances of proofs of such statements, something more is actuallybeing proved. Work of Godel [17] raises some interesting possibilities aboutpossible re-definitions of implication, which seem to be very difficult toimplement in usable generality, and which also seem to run counter to naturalmodes of thought. There seems to be no reason in principle that we shouldnot be able to develop a viable terminology that incorporates more than onemeaning for some or all of the quantifiers and connectives.

    * More important than any of these technical problems is the broaderproblem of involving ourselves more deeply with the meaning of mathematicsat all levels. This is the simplest and most general statement of the con-structivist program, and the technical developments are intended as a meansto that end.
