docs/source/_posts/translation/schizophrenia-in-contemporary-mathematics.html

<div id="outline-container-org7779f38" class="outline-2">
<h2 id="org7779f38">總結 / conclude</h2>
<div class="outline-text-2" id="text-org7779f38">
</div><div id="outline-container-org303bb78" class="outline-3">
<h3 id="org303bb78">譯文</h3>
<div class="outline-text-3" id="text-org303bb78">
<ul class="org-ul">
<li><p>&gt;&lt;</p></li></ul>
</div>
</div>

<div id="outline-container-org7e10ad1" class="outline-3">
<h3 id="org7e10ad1">原文</h3>
<div class="outline-text-3" id="text-org7e10ad1">
<ul class="org-ul">
<li><p>I would like to conclude these lectures by discussing some of the tasksthat face constructive mathematics.</p></li>

<li><p>Of primary importance is the systematic constructive development ofenough of algebra for a pattern to begin to emerge. Of course, it may be thatmuch of the classical theory is inherently unconstructivizable, and thatconstructive algebra will go its own way. It is too early to tell.</p></li>

<li><p>Less critical, but also of interest, is the problem of a convincingconstructive foundation for general topology, to replace the ad hoc definitions incurrent use. It would also be good to see a constructivization of algebraictopology actually carried through, although I suspect this would not pose thecritical difficulties that seem to be arising in algebra.</p></li>

<li><p>To sum up, the first task is to constructivize as much of existingclassical mathematics as is suitable for constructivization. As this is being</p><p>done, we should increasingly turn our attention to questions of the efficiency ofour algorithms, and bridge the gap between constructive mathematics on theone hand and numerical analysis and the theory of computation on the other.Since constructive mathematics is the study of what is theoreticallycomputable, it should afford a sound philosophical basis for the theory ofcomputation.</p></li>

<li><p>Our terminology and technical devices need constant re-examination asto whether they are the most appropriate tools for extracting the full meaningfrom our material. It seems to me that the meaning of implication, inparticular, should be thoroughly studied, and other possible candidatesinvestigated. Such statements as "(A -* B) -* C" have a rather tenuous meaning, andin many instances of proofs of such statements, something more is actuallybeing proved. Work of Godel [17] raises some interesting possibilities aboutpossible re-definitions of implication, which seem to be very difficult toimplement in usable generality, and which also seem to run counter to naturalmodes of thought. There seems to be no reason in principle that we shouldnot be able to develop a viable terminology that incorporates more than onemeaning for some or all of the quantifiers and connectives.</p></li>

<li><p>More important than any of these technical problems is the broaderproblem of involving ourselves more deeply with the meaning of mathematicsat all levels. This is the simplest and most general statement of the con-structivist program, and the technical developments are intended as a meansto that end.</p></li></ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Errett Bishop</p>
<p class="date">Created: 2017-09-28 Thu 21:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
